<html>
<head>
<title>Conception page</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style>
<!--
h1,h2,H3,h4  { font-family: Verdana }

p            { font-family: Verdana; font-size: 12px }
li           { font-family: Verdana; font-size: 12px }
-->
</style>
<link href="../site4/accueil.asp_fichiers/stylessheet.css" rel="stylesheet" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h2><a name="debut">Conception</a> d'une page </h2>
<p>&nbsp; </p>
<address>Sommaire </address>
<ul type="square">
  <li><a href="#Introduction">Introduction</a></li>
  <li><a href="#Les navigateurs">Les navigateurs</a></li>
  <li><a href="#Définir la longueur des pages">Définir la longueur des pages</a></li>
  <li><a href="#Offrir un contenu de valeur">Offrir un contenu de valeur</a></li>
  <li><a href="#Utilisez les niveaux d'en-tête">Utiliser les niveaux d'en-tête</a></li>
</ul>
<hr size="1" color="#808080">
<h3><a name="Introduction">Introduction</a></h3>
<p>Bien que le Web soit relativement jeune, certaines r&egrave;gles se sont d&eacute;j&agrave; 
  impos&eacute;es en ce qui concerne la cr&eacute;ation des pages. Si vous respectez 
  les principes ci-dessous, qui ont trait au texte, &agrave; la longueur des pages, 
  aux images et &agrave; la couleur, vous &ecirc;tes sur la bonne voie pour pr&eacute;senter 
  une page Web attirante et bien con&ccedil;ue que les lecteurs appr&eacute;cieront. 
</p>
<p>Les efforts que vous consacrerez &agrave; la conception de la page, avant de 
  passer &agrave; l'action, ne constituent pas une perte de temps. Tenez compte 
  des points suivants : </p>
<ul>
  <li>Quel est le but de la page ? Offrez-vous une prestation, un produit ou un 
    divertissement ? </li>
  <li> Quelle est l'audience que vous voulez toucher ? La connaissance de vos 
    lecteurs vous aide &agrave; mettre en forme le contenu de la page et &agrave; 
    trouver une fa&ccedil;on coh&eacute;rente de vous adresser &agrave; ceux-ci. 
  </li>
  <li> Comment voulez-vous structurer les informations ? Il est courant de voir 
    au moins deux niveaux hi&eacute;rarchiques : un index au niveau sup&eacute;rieur 
    et des pages au second niveau. Placez le maximum de contenu au sommet de la 
    hi&eacute;rarchie (ce qui permet &agrave; l'utilisateur qui &quot; ne fait 
    que passer &quot; de saisir rapidement le type d'informations que vous pr&eacute;sentez). 
    La fa&ccedil;on la plus facile de pr&eacute;senter les informations est de 
    les diviser : d&eacute;coupez les rubriques en sous-rubriques. Si vous avez 
    plusieurs petites rubriques, groupez-les sur une seule page. </li>
  <li>Combien de liens allez-vous inclure ? Souvenez-vous que les lecteurs peuvent 
    cr&eacute;er des liens leur permettant de se rendre &agrave; votre page d'accueil 
    ainsi qu'&agrave; toutes les autres pages de votre jeu de pages.<br>
    Les lecteurs peuvent &eacute;galement commencer &agrave; consulter votre page 
    Web depuis de nombreux points d'entr&eacute;e puis naviguer parmi ceux-ci 
    de mani&egrave;re arbitraire, en choisissant les points de d&eacute;part et 
    d'arriv&eacute;e de la navigation. Quand vous planifiez le nombre de liens 
    que vous allez inclure, pr&eacute;voyez de tester leur validit&eacute; de 
    fa&ccedil;on r&eacute;guli&egrave;re. </li>
  <li> Combien d'images, de sons, de films allez-vous utiliser ? Plus vos pages 
    seront &eacute;labor&eacute;es, plus elles demanderont du temps et du travail 
    pour les r&eacute;aliser. Il est &eacute;vident que les &eacute;l&eacute;ments 
    multim&eacute;dia contribuent &agrave; la r&eacute;alisation de pages plus 
    attirantes ; ils augmentent toutefois la dur&eacute;e du t&eacute;l&eacute;chargement, 
    ce qui retarde le lecteur &agrave; la recherche d'informations. </li>
</ul>
<hr>
<h3> <a name="Les navigateurs"> Les navigateurs</a></h3>
<h4>Les navigateurs Microsoft</h4>
<ul>
  <li>Internet Explorer 5 ou IE5 (version 5.5, version 5.01)</li>
  <li>Internet Explorer 4 ou IE4</li>
  <li>Internet Explorer 3 ou IE3</li>
</ul>
<h4>Les navigateurs de Netscape</h4>
<ul>
  <li>Netscape 6</li>
  <li>Communicator 4.75</li>
  <li>Communicator 4.51</li>
  <li>Communicator 4.3</li>
  <li>Navigator</li>
</ul>
<p>L'audience du Web augmente sans cesse et le nombre de navigateurs augmente 
  &eacute;galement. Ceci signifie que vous devez supposer que vos lecteurs risquent 
  d'utiliser un autre navigateur. M&ecirc;me ceux qui utilisent Navigator peuvent 
  ne pas l'utiliser constamment (par exemple, les utilisateurs peuvent avoir un 
  navigateur diff&eacute;rent &agrave; domicile et sur leur lieu de travail). 
</p>
<p>Vos document ne doivent pas trop d&eacute;pendre de fonctions HTML qui ne sont 
  pas prises en charge par tous les navigateurs. Si vous d&eacute;cidez d'utiliser 
  les &eacute;tiquettes HTML qui ne sont compatibles qu'avec Netscape, essayez 
  d'imaginer &agrave; quoi ressembleront vos pages sur les autres navigateurs 
  qui n'acceptent pas ces &eacute;tiquettes.<br>
  Tenez compte du fait que certains navigateurs peuvent ne pas accepter vos graphiques 
  et pr&eacute;voyez un texte de remplacement. Navigator (et de nombreux autres 
  navigateurs) permettent aux utilisateurs de choisir la mani&egrave;re d'afficher 
  les pages. Les utilisateurs peuvent choisir leurs polices, des tailles de police, 
  remplacer les couleurs des pages et des arri&egrave;re-plans et ignorer de nombreuses 
  options de formatage sp&eacute;cifi&eacute;es par l'auteur d'une page Web. </p>
<p>Partez de l'hypoth&egrave;se que vos lecteurs disposent d'un &eacute;cran aux 
  caract&eacute;ristiques diff&eacute;rentes du v&ocirc;tre (taille, nombre de 
  couleurs et r&eacute;solution) m&ecirc;me s'ils utilisent le m&ecirc;me navigateur 
  que vous. Cela signifie qu'une page peut appara&icirc;tre sous son meilleur 
  jour sur votre &eacute;cran et &ecirc;tre compl&egrave;tement diff&eacute;rente 
  sur celui d'un autre utilisateur. C'est une raison suppl&eacute;mentaire pour 
  vous concentrer d'abord sur le contenu et n'utiliser les options de pr&eacute;sentation 
  que comme une simple am&eacute;lioration. </p>
<hr>
<h3><a name="Définir la longueur des pages">D&eacute;finir la longueur des pages</a></h3>
<p>Le moniteur des ordinateurs personnels les plus courants affichent<br>
</p>
<p>640 x 480 pixels sur des &eacute;crans de 13 &agrave; 15 pouces ou<br>
  800 x 600 pixels pour les 17 pouces.</p>
<ul>
  <li>&Eacute;tudiez vos pages pour que les informations se pr&eacute;sentent 
    en parties courtes, clairement divis&eacute;es qui facilitent la concision 
    des pages. </li>
  <li>De fa&ccedil;on pratique, une page con&ccedil;ue pour &ecirc;tre lue &agrave; 
    l'&eacute;cran, ne devrait pas &ecirc;tre plus longue que deux &agrave; trois 
    &eacute;crans 640 x 480 d'informations, y compris les liens de navigation 
    locale au d&eacute;but ou &agrave; la fin de la pr&eacute;sentation de la 
    page. Si la page est plus longue que la fen&ecirc;tre, votre lecteur doit 
    se rappeler beaucoup trop d'informations qui disparaissent avec le d&eacute;filement 
    de la page. </li>
  <li>Une longue page Web pr&eacute;sente l'inconv&eacute;nient pour le lecteur 
    de d&eacute;pendre trop de la coulisse de d&eacute;filement vertical lors 
    du parcours de la page. De petits mouvements de d&eacute;filement peuvent 
    compl&egrave;tement changer le contenu de l'&eacute;cran, ne laissant au lecteur 
    aucun point de rep&egrave;re connu. </li>
  <li>Conservez les informations qui sont en &eacute;troite relation au sein d'une 
    seule page Web, surtout si vous pensez que le lecteur va imprimer ou enregistrer 
    le texte. Pour donner aux pages une bonne interface en ligne et pour une impression 
    et un enregistrement facilit&eacute;s, d&eacute;coupez la page en parties 
    correspondant &agrave; deux ou trois pages imprim&eacute;es d'informations, 
    graphiques et figures inclus ; ou bien introduisez un lien vers un fichier 
    distinct qui contient la totalit&eacute; du texte organis&eacute; sur une 
    seule page. </li>
</ul>
<hr>
<h3><a name="Offrir un contenu de valeur">Offrir un contenu de valeur</a></h3>
<p>La pr&eacute;sentation graphique de vos pages doit &ecirc;tre attractive mais 
  pour vos lecteurs, c'est finalement le texte qui en d&eacute;termine la valeur. 
  Si vous voulez offrir un contenu de qualit&eacute;, suivez ces r&egrave;gles 
  simples : </p>
<ul>
  <li> Utilisez des graphiques et des couleurs ainsi que des tailles de polices 
    vari&eacute;es pour am&eacute;liorer la pr&eacute;sentation de vos pages mais 
    assurez-vous que vos pages fonctionnent bien en texte simple et n'oubliez 
    pas de toujours inclure un texte de remplacement pour les &eacute;l&eacute;ments 
    graphiques. </li>
  <li>&Eacute;liminez de votre texte ce qui n'est pas essentiel. Des tests d'utilit&eacute;s 
    ont montr&eacute; que les lecteurs sautent le texte qu'ils consid&egrave;rent 
    inutile et qu'ils n'aiment &ecirc;tre oblig&eacute;s de le faire d&eacute;filer. 
    Souvent, les lecteurs consultent une page et ne lisent r&eacute;ellement que 
    le texte des liens d'hypertexte avant de choisir leur prochaine destination. 
  </li>
  <li> D&eacute;finissez un nombre r&eacute;duit de styles d'en-t&ecirc;tes et 
    de sous-titres pour organiser le contenu de la page puis utilisez les styles 
    que vous avez choisis de fa&ccedil;on r&eacute;p&eacute;titive. Ce n'est pas 
    parce que Composer offre six niveaux d'en-t&ecirc;tes que vous devez tous 
    les utiliser sur une seule page !</li>
</ul>
<hr>
<h3> <a name="Utilisez les niveaux d'en-tête"> Utilisez les niveaux d'en-t&ecirc;te</a></h3>
<p>Dans l'ordre : l'en-t&ecirc;te de niveau 1 le premier et, au besoin, plusieurs 
  en-t&ecirc;te de niveau 2. N'oubliez pas que les diff&eacute;rents navigateurs 
  utilisent des espacements et des polices diff&eacute;rents. Utilisez les niveaux 
  d'en-t&ecirc;te<br>
  Pour indiquer la structure du document : c'est dans ce but qu'ils ont &eacute;t&eacute; 
  con&ccedil;us.</p>
<ul>
  <li>&Eacute;vitez d'utiliser trop souvent le gras, l'italique et de multiples 
    styles de polices dans votre texte.</li>
  <li> Pour att&eacute;nuer la monotonie et la fatigue visuelle provoqu&eacute;e 
    par la lecture d'un texte long sur un ordinateur, vous pouvez utiliser les 
    formats de paragraphe Citation group&eacute;e et Liste &agrave; puces disponibles 
    dans la bo&icirc;te de Dialogue Propri&eacute;t&eacute;s. Ces deux formats 
    mettent en retrait les blocs de texte, ce qui r&eacute;duit la longueur des 
    lignes, conservent des marges nettes et rendent la page plus facile &agrave; 
    parcourir. Vous pouvez &eacute;galement ins&eacute;rer des lignes horizontales 
    pour s&eacute;parer visuellement les diff&eacute;rentes parties du document. 
  </li>
</ul>
<p>&nbsp;</p>
<p align="center"><a href="#debut"><img border="0" src="home.gif" width="15" height="24"></a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
